<section id="resume" class="resume">
  <div class="resume_box">
    <p>인적사항</p>
    <div>
      <p>이정균</p>
      <p>남, 1986 (37세)</p>
      <p>이메일 : kr0106686@gmail</p>
      <p>휴대폰 : 010-6686-6686</p>
      <p>주소 : (21054) 인천 계양구 계산동</p>
    </div>
  </div>
  <div class="resume_box">
    <p>경력</p>
    <div>
      <p>JAVA 국비과정 교육</p>
      <p>LG 출입 관리 시스템 SI 웹프로젝트(2개월)</p>
      <p>심사평가원 SI 웹프로젝트(4개월)</p>
    </div>
  </div>
  <div class="resume_box">
    <p>LG 출입 관리 시스템 SI 웹프로젝트</p>
    <div>
      <p>SMTP 세팅</p>
      <pre>
코드상으로 간단한 기능이였으나 현장에서 개발,운영간 포트 문제로 고생했었음
    </pre>

      <p>파일 다운로드, 업로드 기능</p>
      <pre>
학원에서 했던거였고 
요구사항에 서버에저장할때 파일이름 암호화기능이 추가되었음
확장자때문에 문제가 생겨 확장자는 따로 분리하여
암호화된파일명에 붙이는방식으로 진행
잘 돌아가다가 1kB 정도의 저용량만 작동하는문제발생
톰캣 설정문제로 예상되어 인프라팀으로 전달
    </pre>

      <p>DB 데이터 마이그레이션</p>
      <pre>
as-is DB2에서 to-be MariaDB 데이터 마이그레이션작업
개발과정중 to-be 디비를 자주 비웠고 마이그레이션작업할때
몇개의 테이블 마이그레이션 작업함
전문적인 데이터 마이그레이션 작업은아니었기에 간단히 CSV 파일로 이동
문자열 깨지는문제와 입력테이블 순서잘못되어서 입력안되는문제등으로 고생
    </pre>

      <p>Batch 세팅</p>
      <pre>
쉽게보면 배치라이브러리 추가후 
간단한 세팅하고 기본적인 job, step 기능확인까지가 한일

현장이 MyBatis였는대 인터넷검색하면 MyBatis배치세팅이 별로없어고생

처음에는 웹프로젝트에 배치라이브러리를 추가하였으나
배치가 웹프로젝트에 붙어있을필요는 없다판단하여 별도프로젝트로 개발
git저장소 한동안 안만들어줘서 
웹프로젝트내부에 폴더만들어서 이상하게 개발했다

배치로그파일이 GB단위까지 늘어나는걸 주말에 집에서 발견
서버문제생길까 겁먹어서 PM한태 연락했던 경험이있다

물론지금도 Batch가 어떤식으로 동작하는지
어떤경우 사용하는지도 
대용량처리에 사용한다는것말고 모른다

이후 job step 실제 배치처리작업은
다른분들이 추가했다
    </pre>

      <p>크롤링 세팅</p>
      <pre>
결과적으로 만들려는기능은 배치돌다가 걸리는 누군가에게 메일을 보내는거였다
메일양식을 html파일로 줬는대 
자바코드에서 html파일을 수정방법을 고민하다가 크롤링 적용
배치프로젝트에 크롤링라이브러리 jsoup 추가
양식파일 읽어와서 변경해야하는 태그 잡아다가 내용바꾸는 기능정도만 만들었다
    </pre>

      <p>POI 세팅</p>
      <pre>
라이브러리 추가하고 엑셀파일간단하게 조작정도까지만확인했다
    </pre>

      <p>...</p>
      <pre>
첫 취업 SI 프로젝트였고
2달정도 일하다가 개인적인문제로 그만두게되었다

2달치고 말들이 근사하지만 
사실은 간단한 라이브러리추가세팅이 주업무였다

아무리 그래도 이걸 딱봐도 뻥튀기 초보한태 왜 시켰는지의문이지만
결과적으로 어떻게든 돌아갔고 좋은경험이였다
    </pre>
    </div>

    <p>심사평가원 SI 웹프로젝트</p>
    <div>
      <p>Thymeleaf 페이지개발</p>
      <pre>
PC화면은 거의 구현되어있는단계였고
모바일화면 개발이 주업무였다
대부분 PC화면베이스에
모바일화면에서 문제생기는것들 위주로 작업했다
몇달간 Thymeleaf 만졌지만
이후 전혀쓸기회가 없어 아쉽다
    </pre>
      <p>...</p>
      <pre>
4달을 일하였지만 LG와는 다르게 특별히 쓸것이없다
PC화면개발단계에서 SQL도 거의 완성되어있는상태여서
SQL을 만질일도 거의 없었다
실무현장에서 SQL경험이 적다보니 SQL이 약한편이다
    </pre>
    </div>
    <p>개인 프로젝트</p>
    <div>
      <p>...</p>
      <pre>
한동안 개발안하다 
5월달부터 조금씩 공부중이다
짬짬이 하다보니 생각보다 결과물이 안나온다
최근 만졌던거 생각나는대로 정리
    </pre>
      <p>웹 프레임워크</p>
      <pre>
NEXT.js와 SvelteKit 중에서 고민하다
SvelteKit 사용중이다
예전 SPA때문에 프론트와 백엔드따로
개발할때보다 훨신 편하지만
최근 간단하게 express, ejs 사용해보니
Socket.io 세팅, 배포과정 등에서 
간단하고 가벼워 너무 편했다
풀스택프레임워크 버리는걸 고민중이다
    </pre>
      <p>서버컴퓨터</p>
      <pre>
예전에 AWS로 이거저거하다가 돈나온적이있어 오라클사용중이다
Centos7 사용하였으나 SvelteKit, Node 등 최신버전 설치에 문제가 생겨
Centos8 사용중이다
사실 리눅스는 필요한거 설치하고 서버실행만 할줄아는수준이라
차이점도 잘 모르겠다
    </pre>
      <p>데이터베이스</p>
      <pre>
데이터베이스를 깊이 다루지도 못하다보니 뭘 사용하던 거기서거기지만
Mysql은 상용화시 유료라는점이 뭔가모르게 싫었다
MariaDB와 Postgresql중 고민하다 Postgresql로 결정하였다
설치하고 접속권한설정문제로 고생좀했다
물론 오라클보다 훨씬간편
    </pre>
      <p>OAuth 로그인</p>
      <pre>
처음에 Auth.js라는 라이브러리를 SvelteKit에 설치하여구현을했다
조금만지다보니 조금 깊이알아야할 필요성이느껴져 직접구현해봤다
어느정도 작동하게 구현은되는대 기능제공업체를 늘리려고하니
공급자마다 조금씩 다른부분에 짜증나고 코드정리가 잘안된다
    </pre>
      <p>Nginx</p>
      <pre>
서버컴퓨터한개로 여러서버를 돌리고싶었다
뒤에 포트가 붙는거는 싫어서 찾아보니
Nginx설치하고 설정하라고해서 했다
그냥 복붙 몇개했다 Nginx쓸줄 모른다
잘된다 SSL도 잘된다 그러나 나중에 문제가 발생했다 
이미지안뜨는문제 쿠키설정안되는문제 였는대 
Nginx버퍼설정문제였다
로컬에서는 되다가 서버에서 안되는거라고
로그도 안나와서 꽤 고생했다
    </pre>
      <p>ORM</p>
      <pre>
Prisma를 사용해봤다
좋은점도있었고 불편한점도있었는데 SQL연습하려고 버렸다
    </pre>
      <p>Socket.io</p>
      <pre>
능숙하게 사용하고싶은 기능이다
SvelteKit에 세팅할때 고생조금했다
현재 서버에서까지 문제없이 동작은하는대 
개발할때 SvelteKit이랑 socket서버 따로켜야한다
좋은방법이 있을꺼같은대 못찾아서 번거롭게 작업중
    </pre>
    </div>
  </div>
</section>

<style>
  .resume {
    width: 100%;
  }
  .resume_box {
    margin-top: 10px;
    padding: 10px;
    border: 1px solid black;
  }

  .resume_box > p {
    font-weight: bold;
    font-size: 20px;
    margin-top: 10px;
  }

  .resume_box div {
    margin-top: 10px;
  }
  .resume_box pre {
    white-space: pre-wrap;
    padding-top: 10px;
  }
</style>
